#+TITLE: Docker 101
#+SUBTITLE: Hackerschool, NUS Hackers
#+DATE: 2017/10/14
#+AUTHOR: Jethro Kuan
#+EMAIL: jethrokuan95@gmail.com
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

#+WWW: http://www.nushackers.org/
#+TWITTER: @nushackers

#+FAVICON: images/docker/docker.png
#+ICON: images/docker/docker.png
#+HASHTAG: #hackerschool #docker

* Getting Familiar with Docker
#+BEGIN_SRC sh
docker ps
#+END_SRC

#+RESULTS:
: CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS              PORTS               NAMES
** Pulling Images
#+BEGIN_SRC sh
  docker pull alpine
#+END_SRC

#+RESULTS:
| Using         | default                                                                 | tag:     | latest         |     |               |
| latest:       | Pulling                                                                 | from     | library/alpine |     |               |
| 88286f41530e: | Pulling                                                                 | fs       | layer          |     |               |
| 88286f41530e: | Download                                                                | complete |                |     |               |
| 88286f41530e: | Pull                                                                    | complete |                |     |               |
| Digest:       | sha256:f006ecbb824d87947d0b51ab8488634bf69fe4094959d935c0c103f4820a417d |          |                |     |               |
| Status:       | Downloaded                                                              | newer    | image          | for | alpine:latest |

#+BEGIN_SRC sh
  docker ps -a
#+END_SRC



#+RESULTS:
